export type MappingType = {
  [key: string]: {
    [code: string]: string;
  };
};

export const mappings: MappingType = {
  CMM002: {
    // 사유코드 rsn_cd
    "001": "감사대비용",
    "002": "업무확인용",
    "999": "기타",
  },
  PUR001: {
    // 입찰결과 bid_res
    "001": "낙찰",
    "002": "유찰",
    "003": "취소",
  },
  PUR002: {
    // 공고구분 ann_cat
    "001": "본공고",
    "002": "재공고",
  },
  PUR003: {
    // 계약종류 cont_type
    "001": "일반계약",
    "002": "단가계약",
    "003": "임대계약",
    "004": "공사계약",
    "005": "매각계약",
    "006": "기타계약",
  },
  PUR004: {
    // 입찰종류 bid_type
    "001": "일반경쟁",
    "002": "제한경쟁",
    "003": "지명경쟁",
  },
  PUR005: {
    // 낙팔방법 bid_method
    "001": "최저가격",
    "002": "2단계경쟁",
    "003": "협상에의한계약",
  },
  PUR006: {
    // 계정코드 acc_cd
    "001": "의약품",
    "002": "항정신성의약품",
    "003": "장비소모품",
    "004": "인쇄물",
    "005": "시약",
    "006": "의료비품",
    "007": "의료장비",
    "008": "사무용품",
    "009": "기타",
  },
  PUR007: {
    // 계약방법 cont_method
    "001": "입찰",
    "002": "수의",
  },
  PUR008: {
    // 계약구분 cont_div
    "001": "최초계약",
    "002": "연장계약",
    "003": "변경계약",
  },
  PUR009: {
    // 파일그룹구분 grp_type
    "001": "입찰품의서",
    "002": "입찰공고문",
    "003": "입찰참가서류",
    "004": "입찰보증보험",
    "005": "입찰평가서",
    "006": "계약품의서",
    "007": "계약서",
    "008": "계약보증보험",
    "009": "하자이행보증보험",
  },
};
